      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NINETY-BOTTLES-BEER.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NO-BOTT

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM NINETY-BOTTLES-BEER.
