       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA-DE-ADESTRAMENTO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT IN-ARQ-EMPREGADOS
           ASSIGN TO DISK './EMPREGADOS.TXT'
           ORGANIZATION IS LINE SEQUENTIAL.
       SELECT OUT-ARQ-SALARIO
           ASSIGN TO DISK './SALARIO.TXT'
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD IN-ARQ-EMPREGADOS LABEL RECORDS ARE STANDARD.
       01 REG-ARQ-EMPREGADOS.
           05 IN-NOME-EMPREGADO   PIC X(20).
           05 IN-SALARIO          PIC 9(5).
           05 IN-NO-DEPENDENTES   PIC 9(1).
           05 IN-INSS             PIC 9(5).
           05 IN-IMPOSTO-ESTADUAL PIC 9(6).
           05 IN-IMPOSTO-FEDERAL  PIC 9(6).
           05 IN-DATA-ADMISSAO.
               10 IN-DIA          PIC 99.
               10 IN-MES          PIC 99.
               10 IN-ANO          PIC 9999.

       FD OUT-ARQ-SALARIO LABEL RECORDS ARE OMITTED.
       01 REG-ARQ-SALARIO.
           05 OUT-NOME-EMPREGADO PIC X(20).
           05 OUT-SALARIO        PIC 9(5).

       WORKING-STORAGE SECTION.
       01 PGTO PIC 9(5).
       01 EXISTEM-MAIS-REGISTROS PIC A(1) VALUE 'Y'.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN INPUT  IN-ARQ-EMPREGADOS
                OUTPUT OUT-ARQ-SALARIO.
           PERFORM UNTIL EXISTEM-MAIS-REGISTROS = 'N'
               READ IN-ARQ-EMPREGADOS
               AT END
                   MOVE 'N' TO EXISTEM-MAIS-REGISTROS
               NOT AT END
                   PERFORM CALCULA-SALARIO
           END-PERFORM
           CLOSE IN-ARQ-EMPREGADOS
                 OUT-ARQ-SALARIO
           STOP RUN.

       CALCULA-SALARIO.
           MOVE SPACES TO REG-ARQ-SALARIO
           MOVE IN-NOME-EMPREGADO TO OUT-NOME-EMPREGADO
           MOVE IN-SALARIO TO PGTO
           SUBTRACT IN-INSS FROM PGTO GIVING OUT-SALARIO
           WRITE REG-ARQ-SALARIO.

       END PROGRAM PROGRAMA-DE-ADESTRAMENTO.
